spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
    return true;
}

bool SmdSat::send_command_aplus(uint8_t command, const uint8_t *tx_data, uint16_t tx_len,
                                SpiAplusResponse *response) {
    // Build the A+ frame (fixed 64 bytes)
    uint8_t tx_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];
    uint8_t rx_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];

    uint16_t frame_len = build_aplus_frame(tx_frame, command, tx_data, tx_len);
    if (frame_len == 0) {
        DEBUG_ERROR("SmdSat::%s: Failed to build frame", __func__);
        return false;
    }

    memset(rx_frame, 0, sizeof(rx_frame));

    // Transaction 1: Send command (response will be in transaction 2)
    int ret = m_nrf_spim->transfer(tx_frame, rx_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE);
    if (ret) {
        DEBUG_ERROR("SmdSat::%s: SPI transfer failed", __func__);
        throw ErrorCode::SPI_COMMS_ERROR;
    }

    // Wait for SMD to process command
    nrf_delay_ms(SMDSAT_SPI_INTER_TX_DELAY_MS);

    // Transaction 2: Send NOP to retrieve response (pipelined protocol)
    uint8_t nop_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];
    uint8_t response_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];

    // Build NOP frame (command 0x00)
    uint8_t saved_seq = m_sequence_number;
    m_sequence_number++;  // Increment for NOP
    build_aplus_frame(nop_frame, SMDSAT_CMD_NONE, nullptr, 0);

    memset(response_frame, 0, sizeof(response_frame));

    // Wait for processing
    nrf_delay_ms(SMDSAT_TIMING_STANDARD_MS);

    ret = m_nrf_spim->transfer(nop_frame, response_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE);
    if (ret) {
        DEBUG_ERROR("SmdSat::%s: Failed to read response", __func__);
        throw ErrorCode::SPI_COMMS_ERROR;
    }

    // Handle BUSY pattern with retries
    for (uint8_t busy_retry = 0; busy_retry < SMDSAT_SPI_BUSY_MAX_RETRIES; busy_retry++) {
        if (response_frame[0] == SPI_PROTOCOL_APLUS_BUSY_PATTERN &&
            response_frame[1] == SPI_PROTOCOL_APLUS_BUSY_PATTERN) {
            DEBUG_TRACE("SmdSat::%s: BUSY, retry %u/%u", __func__, busy_retry + 1, SMDSAT_SPI_BUSY_MAX_RETRIES);
            nrf_delay_ms(SMDSAT_SPI_BUSY_RETRY_DELAY_MS);

            // Send another NOP to poll for response
            m_sequence_number++;
            build_aplus_frame(nop_frame, SMDSAT_CMD_NONE, nullptr, 0);
            memset(response_frame, 0, sizeof(response_frame));

            ret = m_nrf_spim->transfer(nop_frame, response_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE);
            if (ret) {
                throw ErrorCode::SPI_COMMS_ERROR;
            }
        } else {
            break;
        }
    }

    // Parse response if caller wants it
    if (response != nullptr) {
        // Restore sequence number for validation (response should match original command seq)
        uint8_t current_seq = m_sequence_number;
        m_sequence_number = saved_seq;

        bool parsed = parse_aplus_response(response_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE, response);

        m_sequence_number = current_seq;

        if (!parsed && !SPI_APLUS_IS_RECOVERABLE(response->status)) {
            return false;
        }
    }

    return true;
}

bool SmdSat::detect_protocol() {
    DEBUG_TRACE("SmdSat::%s: Detecting protocol mode", __func__);

    m_sequence_number = 0;

    // Build A+ ping frame
    uint8_t tx_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];
    uint8_t rx_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];

    build_aplus_frame(tx_frame, SMDSAT_CMD_PING, nullptr, 0);
    memset(rx_frame, 0, sizeof(rx_frame));

    int ret = m_nrf_spim->transfer(tx_frame, rx_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE);
    if (ret) {
        DEBUG_WARN("SmdSat::%s: A+ ping transfer failed, falling back to legacy", __func__);
        m_protocol_mode = SpiProtocolMode::LEGACY;
        m_protocol_detected = true;
        return false;
    }

    nrf_delay_ms(SMDSAT_TIMING_STANDARD_MS);

    // Send NOP to get response (pipelined)
    uint8_t nop_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];
    uint8_t response_frame[SPI_PROTOCOL_APLUS_FRAME_SIZE];

    m_sequence_number++;
    build_aplus_frame(nop_frame, SMDSAT_CMD_NONE, nullptr, 0);
    memset(response_frame, 0, sizeof(response_frame));

    ret = m_nrf_spim->transfer(nop_frame, response_frame, SPI_PROTOCOL_APLUS_FRAME_SIZE);
    if (ret) {
        m_protocol_mode = SpiProtocolMode::LEGACY;
        m_protocol_detected = true;
        return false;
    }

    // Check if response looks like A+ (starts with magic 0x55)
    if (response_frame[0] == SPI_PROTOCOL_APLUS_MAGIC_RESPONSE) {
        DEBUG_INFO("SmdSat::%s: Protocol A+ detected", __func__);
        m_protocol_mode = SpiProtocolMode::APLUS;
        m_protocol_detected = true;
        m_sequence_number++;
        return true;
    }

    // Check for BUSY/IDLE patterns (also indicates A+ mode)
    if (response_frame[0] == SPI_PROTOCOL_APLUS_BUSY_PATTERN ||
        response_frame[0] == SPI_PROTOCOL_APLUS_IDLE_PATTERN) {
        DEBUG_INFO("SmdSat::%s: Protocol A+ detected (pattern 0x%02X)", __func__, response_frame[0]);
        m_protocol_mode = SpiProtocolMode::APLUS;
        m_protocol_detected = true;
        m_sequence_number++;
        return true;
    }

    // Legacy response
    DEBUG_INFO("SmdSat::%s: Legacy protocol detected (response[0]=0x%02X)", __func__, response_frame[0]);
    m_protocol_mode = SpiProtocolMode::LEGACY;
    m_protocol_detected = true;
    return false;
}

// Helper to check if we need longer delay for flash operations
static uint32_t get_command_delay(uint8_t cmd) {
    switch (cmd) {
        case SMDSAT_CMD_DFU_ERASE:
            return SMDSAT_TIMING_ERASE_MS;
        case SMDSAT_CMD_DFU_WRITE_DATA:
        case SMDSAT_CMD_DFU_SET_HEADER:
        case SMDSAT_CMD_WRITE_RCONF:
        case SMDSAT_CMD_WRITE_KMAC:
        case SMDSAT_CMD_WRITE_SECKEY:
        case SMDSAT_CMD_SAVE_RCONF:
            return SMDSAT_TIMING_WRITE_MS;
        case SMDSAT_CMD_DFU_RESET:
        case SMDSAT_CMD_DFU_JUMP:
            return SMDSAT_TIMING_RESET_MS;
        default:
            return SMDSAT_TIMING_STANDARD_MS;
    }
}

bool SmdSat::send_command_auto(uint8_t command, const uint8_t *tx_data, uint16_t tx_len,
                               uint8_t *rx_data, uint16_t rx_len) {
    // Auto-detect protocol on first use
    if (!m_protocol_detected) {
        detect_protocol();
    }

    if (m_protocol_mode == SpiProtocolMode::APLUS) {
        // Use Protocol A+ framing with retry logic
        SpiAplusResponse response;

        for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
            if (send_command_aplus(command, tx_data, tx_len, &response)) {
                // Copy response data if requested
                if (rx_data != nullptr && rx_len > 0 && response.data_len > 0) {
                    uint16_t copy_len = (response.data_len < rx_len) ? response.data_len : rx_len;
                    memcpy(rx_data, response.data, copy_len);
                }

                if (response.status == SPI_APLUS_STATUS_OK) {
                    return true;
                }

                // Check if recoverable error
                if (!SPI_APLUS_IS_RECOVERABLE(response.status)) {
                    DEBUG_WARN("SmdSat::%s: Non-recoverable error %u", __func__, static_cast<int>(response.status));
                    return false;
                }
            }

            DEBUG_TRACE("SmdSat::%s: Retry %u/%u", __func__, retry + 1, SMDSAT_SPI_MAX_RETRIES);
            nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
        }

