spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
        return false;
    } else {
        // Use legacy protocol
        try {
            if (tx_data == nullptr || tx_len == 0) {
                send_command(command);
            } else {
                uint8_t *full_tx = static_cast<uint8_t*>(calloc(tx_len + 1, sizeof(uint8_t)));
                uint8_t *full_rx = static_cast<uint8_t*>(calloc(tx_len + 1, sizeof(uint8_t)));

                if (full_tx == nullptr || full_rx == nullptr) {
                    free(full_tx);
                    free(full_rx);
                    return false;
                }

                full_tx[0] = command;
                memcpy(full_tx + 1, tx_data, tx_len);
                send_command(full_tx, full_rx, tx_len + 1);

                if (rx_data != nullptr && rx_len > 0) {
                    uint16_t copy_len = (tx_len < rx_len) ? tx_len : rx_len;
                    memcpy(rx_data, full_rx + 1, copy_len);
                }

                free(full_tx);
                free(full_rx);
            }
            return true;
        } catch (...) {
            return false;
        }
    }
}

void SmdSat::load_kmac_profil(uint8_t profile)
{
	DEBUG_TRACE("SmdSat::%s:Load KMAC profile %u",__func__, profile);
	uint8_t tx[SMDSAT_CMD_WRITEKMAC_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_WRITEKMAC_LEN] = {0};
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	send_command(SMDSAT_CMD_WRITE_KMAC_REQ);
	tx[0] = SMDSAT_CMD_WRITE_KMAC;
	tx[1] = profile;
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	send_command(tx, rx, SMDSAT_CMD_WRITEKMAC_LEN);
}

void SmdSat::get_spi_status(uint8_t *status) {
	send_command(SMDSAT_CMD_SPI_STATUS);
	read_byte(status);
	DEBUG_TRACE("SmdSat::%s=%s", __func__, (char *)spistatus_string[*status]);
}

void SmdSat::get_kmac_status(uint8_t *status) {
	DEBUG_TRACE("SmdSat::%s:%s", __func__, (char *)kmacstatus_string[*status]);
	send_command(SMDSAT_CMD_MAC_STATUS);
	read_byte(status);
}

bool SmdSat::is_spi_ready() {
	uint8_t status = 0;
	get_spi_status(&status);
	return (status == SMDSAT_SPICMD_IDLE || status == SMDSAT_SPICMD_INIT);
}

bool SmdSat::is_spi_error() {
	uint8_t status = 0;
	get_spi_status(&status);
	return (status == SMDSAT_SPICMD_ERROR);
}

bool SmdSat::wait_for_spi_ready(uint32_t timeout_ms) {
	uint32_t elapsed = 0;
	const uint32_t poll_interval = SMDSAT_SPI_RETRY_DELAY_MS;

	while (elapsed < timeout_ms) {
		uint8_t status = 0;
		get_spi_status(&status);

		if (status == SMDSAT_SPICMD_IDLE || status == SMDSAT_SPICMD_INIT) {
			return true;
		}

		if (status == SMDSAT_SPICMD_ERROR) {
			DEBUG_WARN("SmdSat::%s: SPI in ERROR state, waiting for recovery", __func__);
		}

		nrf_delay_ms(poll_interval);
		elapsed += poll_interval;
	}

	DEBUG_ERROR("SmdSat::%s: Timeout waiting for SPI ready (waited %u ms)", __func__, timeout_ms);
	return false;
}

bool SmdSat::send_command_with_retry(uint8_t command, uint8_t max_retries) {
	for (uint8_t retry = 0; retry < max_retries; retry++) {
		if (!wait_for_spi_ready()) {
			DEBUG_WARN("SmdSat::%s: SPI not ready, retry %u/%u", __func__, retry + 1, max_retries);
			nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
			continue;
		}

		try {
			send_command(command);
			return true;
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: Command 0x%02X failed, retry %u/%u", __func__, command, retry + 1, max_retries);
			nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
		}
	}

	DEBUG_ERROR("SmdSat::%s: Command 0x%02X failed after %u retries", __func__, command, max_retries);
	return false;
}

bool SmdSat::send_command_with_retry(const uint8_t *tx_data, uint8_t *rx_data, uint16_t size, uint8_t max_retries) {
	for (uint8_t retry = 0; retry < max_retries; retry++) {
		if (!wait_for_spi_ready()) {
			DEBUG_WARN("SmdSat::%s: SPI not ready, retry %u/%u", __func__, retry + 1, max_retries);
			nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
			continue;
		}

		try {
			send_command(tx_data, rx_data, size);
			return true;
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: Command failed, retry %u/%u", __func__, retry + 1, max_retries);
			nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
		}
	}

	DEBUG_ERROR("SmdSat::%s: Command failed after %u retries", __func__, max_retries);
	return false;
}

void SmdSat::set_radio_conf(smd_uint8_array_t *radio_conf) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	if(radio_conf->size != SMDSAT_CMD_WRITECONF_LEN - 1){
		DEBUG_ERROR("SmdSat::%s:Size allocated to set radio conf %u != from %u",
			__func__, radio_conf->size, SMDSAT_CMD_WRITECONF_LEN - 1);
		return;
	}
	send_command(SMDSAT_CMD_WRITE_RCONF_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITECONF_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_RCONF;
	memcpy(&(tx[1]), radio_conf->p_data, radio_conf->size);
	send_command(tx, NULL, SMDSAT_CMD_WRITECONF_LEN);
}

void SmdSat::read_radio_conf(SmdArgosModulation *modulation){
	DEBUG_TRACE("%s",__func__);
	send_command(SMDSAT_CMD_READ_RCONF);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t rx[SMDSAT_CMD_READCONF_LEN] = {0};
	uint8_t tx[SMDSAT_CMD_READCONF_LEN] = {0};
	send_command(tx, rx, SMDSAT_CMD_READCONF_LEN);

    uint32_t min_frequency = (rx[3] << 24) | (rx[2] << 16) | (rx[1] << 8) | rx[0];
    uint32_t max_frequency = (rx[7] << 24) | (rx[6] << 16) | (rx[5] << 8) | rx[4];
    int8_t rf_level = rx[8];
    *modulation = static_cast<SmdArgosModulation>(rx[9]);

    DEBUG_INFO("SmdSat::%s:Modulation: %u, Min Frequency: %u, Max Frequency: %u, RF Level %d", __func__,
		*modulation, min_frequency, max_frequency, rf_level);
}

bool SmdSat::save_radio_conf(){
	DEBUG_TRACE("%s",__func__);
	send_command(SMDSAT_CMD_SAVE_RCONF);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t ack = 0;
	read_byte(&ack);
	if (ack == 1) {
		DEBUG_INFO("SmdSat::%s:radio conf saved",__func__);
		return true;
	} else {
		DEBUG_WARN("SmdSat::%s:radio conf failed to save",__func__);
		return false;
	}
}

void SmdSat::read_lpm(uint8_t *lpm_mode) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	send_command(SMDSAT_CMD_READ_LPM);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	read_byte(lpm_mode);
	DEBUG_INFO("SmdSat::SMD LPM mode is: %u", *lpm_mode);
}

void SmdSat::write_lpm(uint8_t *lpm_mode){
	DEBUG_TRACE("SmdSat::%s",__func__);
	send_command(SMDSAT_CMD_WRITE_LPM_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_LPM_LEN], rx[SMDSAT_CMD_WRITE_LPM_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_LPM;
	tx[1] = *lpm_mode;
	send_command(tx, rx, SMDSAT_CMD_WRITE_LPM_LEN);
}

