spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::read_version(uint8_t *version){
	DEBUG_TRACE("SmdSat::%s",__func__);
	send_command(SMDSAT_CMD_READ_VERSION);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	read_byte(version);
	DEBUG_INFO("SmdSat::SMD SPI Version: %u", *version);
}

void SmdSat::read_address(smd_uint8_array_t *address){
	DEBUG_TRACE("%s",__func__);
	if(address->size != SMDSAT_CMD_READ_ADDR_LEN){
		DEBUG_ERROR("SmdSat::%s:Size allocated to store address %u != from %u",
			__func__, address->size, SMDSAT_CMD_READ_ADDR_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_ADDR);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_ADDR_LEN] = {0};
	send_command(tx, address->p_data, address->size);
}

void SmdSat::set_address(smd_uint8_array_t *address){
	DEBUG_TRACE("%s",__func__);
	if(address->size != SMDSAT_CMD_WRITE_ADDR_LEN-1){
		DEBUG_ERROR("SmdSat::%s:Size allocated to store address %u != from %u",
			__func__, address->size, SMDSAT_CMD_WRITE_ADDR_LEN-1);
		return;
	}
	send_command(SMDSAT_CMD_WRITE_ADDR_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_ADDR_LEN], rx[SMDSAT_CMD_WRITE_ADDR_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_ADDR;
	memcpy(&(tx[1]), address->p_data, address->size);
	send_command(tx, rx, (uint16_t)SMDSAT_CMD_WRITE_ADDR_LEN);
}

void SmdSat::read_seckey(smd_uint8_array_t *seckey){
	DEBUG_TRACE("SmdSat::%s",__func__);
	if(seckey->size != SMDSAT_CMD_READ_SECKEY_LEN){
		DEBUG_ERROR("SmdSat::%s:Size allocated to store seckey %u != from %u",
			__func__, seckey->size, SMDSAT_CMD_READ_SECKEY_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_SECKEY);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_SECKEY_LEN] = {0};
	send_command(tx, seckey->p_data, seckey->size);
}

void SmdSat::set_seckey(smd_uint8_array_t *seckey){
	DEBUG_TRACE("%s",__func__);
	if(seckey->size != SMDSAT_CMD_WRITE_SECKEY_LEN - 1){
		DEBUG_ERROR("SmdSat::%s:Size allocated to store seckey %u != from %u",
			__func__, seckey->size, SMDSAT_CMD_WRITE_SECKEY_LEN);
		return;
	}
	send_command(SMDSAT_CMD_WRITE_SECKEY_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_SECKEY_LEN], rx[SMDSAT_CMD_WRITE_SECKEY_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_SECKEY;
	memcpy(&(tx[1]), seckey->p_data, seckey->size);
	send_command(tx, rx, SMDSAT_CMD_WRITE_SECKEY_LEN);
}

void SmdSat::read_id(uint32_t *id){
	if (id == nullptr) {
		DEBUG_ERROR("SmdSat::%s:id ptr is null",__func__);
		return;
	}
	send_command(SMDSAT_CMD_READ_ID);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	send_command(tx, rx, SMDSAT_CMD_READ_ID_LEN);
	*id = 0;
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*id |= rx[i] << (8 * i);
	}
	DEBUG_INFO("SmdSat::%s:SMD ID: %u", __func__, *id);
}

void SmdSat::set_id(uint32_t id){
	DEBUG_TRACE("SmdSat::%s: id: %u",__func__, id);
	send_command(SMDSAT_CMD_WRITE_ID_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_ID_LEN], rx[SMDSAT_CMD_WRITE_ID_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_ID;
	memcpy(&(tx[1]), &id, sizeof(id));
	send_command(tx, rx, SMDSAT_CMD_WRITE_ID_LEN);
}

void SmdSat::read_tcxo_warmup(uint8_t *time_ms){
	if (time_ms == nullptr) {
		DEBUG_ERROR("SmdSat::%s:tcxo ptr is null",__func__);
		return;
	}
	send_command(SMDSAT_CMD_READ_TCXO);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	send_command(tx, rx, SMDSAT_CMD_READ_ID_LEN);
	*time_ms = 0;
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*time_ms |= rx[i] << (8 * i);
	}
	DEBUG_INFO("SmdSat::%s:SMD TCXO warmup time: %u", __func__, *time_ms);
}

void SmdSat::write_tcxo_warmup(uint32_t time_ms){
	DEBUG_TRACE("SmdSat::%s: tcxo warmup time: %u",__func__, time_ms);
	send_command(SMDSAT_CMD_WRITE_TCXO_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_TCXO_LEN], rx[SMDSAT_CMD_WRITE_TCXO_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_TCXO;
	memcpy(&(tx[1]), &time_ms, sizeof(time_ms));
	send_command(tx, rx, SMDSAT_CMD_WRITE_TCXO_LEN);
}

void SmdSat::read_serial(smd_uint8_array_t *serial){
	DEBUG_TRACE("%s",__func__);
	if(serial->size != SMDSAT_CMD_READ_SERIAL_LEN){
		DEBUG_ERROR("SmdSat::%s:Size allocated to store serial %u != from %u",
			__func__, serial->size, SMDSAT_CMD_READ_SERIAL_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_SN);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_SERIAL_LEN] = {0};
	send_command(tx, serial->p_data, serial->size);
}

void SmdSat::set_tcxo_warmup_internal(uint32_t time_s)
{
	DEBUG_TRACE("SmdSat::%s",__func__);
	this->write_tcxo_warmup(time_s*1000);
}

void SmdSat::set_tcxo_control(bool state) {
	(void)state;
	DEBUG_TRACE("SmdSat::%s: Managed by SMD module",__func__);
}

void SmdSat::print_firmware_version() {
	send_command(SMDSAT_CMD_READ_FIRMWARE);
	uint8_t tx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
	send_command(tx, rx, (uint16_t)SMDSAT_CMD_READ_FIRMWARE_LEN);
    DEBUG_TRACE("SmdSat::%s: %s", __func__, rx);
}

bool SmdSat::smd_ping()
{
	DEBUG_TRACE("SmdSat::%s",__func__);

	// If protocol not yet detected, try detection with A+ first
	if (!m_protocol_detected && m_nrf_spim != nullptr) {
		if (detect_protocol()) {
			// Protocol A+ detected and ping succeeded during detection
			DEBUG_INFO("SmdSat::%s: ACK from SMD received (A+ protocol)",__func__);
			return true;
		}
		// If detection failed or legacy detected, continue with legacy ping below
	}

	// Use Protocol A+ if detected
	if (m_protocol_detected && m_protocol_mode == SpiProtocolMode::APLUS) {
		for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
			SpiAplusResponse response;
			try {
				if (send_command_aplus(SMDSAT_CMD_PING, nullptr, 0, &response)) {
					if (response.status == SPI_APLUS_STATUS_OK) {
						DEBUG_INFO("SmdSat::%s: ACK from SMD received (A+)",__func__);
						return true;
					}
				}
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: A+ Ping failed, retry %u/%u", __func__, retry + 1, SMDSAT_SPI_MAX_RETRIES);
			}
			nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
		}
	}

	// Legacy protocol ping
	for (uint8_t retry = 0; retry < SMDSAT_SPI_MAX_RETRIES; retry++) {
		try {
			send_command(SMDSAT_CMD_PING);
			uint8_t ping = 0;
			read_byte(&ping);
			if (ping == 1) {
				DEBUG_INFO("SmdSat::%s: ACK from SMD received (legacy)",__func__);
				return true;
			} else {
				DEBUG_TRACE("SmdSat::%s: Ping response: %u (retry %u/%u)", __func__, ping, retry + 1, SMDSAT_SPI_MAX_RETRIES);
			}
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: Ping failed, retry %u/%u", __func__, retry + 1, SMDSAT_SPI_MAX_RETRIES);
		}
		nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
	}

	DEBUG_WARN("SmdSat::%s: Ping not received after %u retries", __func__, SMDSAT_SPI_MAX_RETRIES);
	return false;
}

bool SmdSat::is_tx_finished() {
	DEBUG_TRACE("SmdSat::%s",__func__);
    uint8_t kmac_status = 0;
	get_kmac_status(&kmac_status);
	return (kmac_status == MAC_TX_DONE);
}

