spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	DEBUG_INFO("SmdSat::%s: Credentials set successfully", __func__);

cleanup:
	if (stop_spi) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}
	if (was_stopped) {
		shutdown();
	}
}

void SmdSat::read_credentials(unsigned int *dec_id, unsigned int *address, std::string *seckey, std::string *radioconf) {
	DEBUG_TRACE("SmdSat::%s",__func__);
	bool stop_spi = false;
	if (m_state == SmdSatState::stopped) {
		GPIOPins::clear(SAT_RESET);
		GPIOPins::set(SAT_PWR_EN);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::set(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}
	if (m_nrf_spim == nullptr) {
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		stop_spi = true;
	}
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	if (dec_id) {
		uint32_t dec_id_val = 0;
        read_id(&dec_id_val);
		*dec_id = static_cast<unsigned int>(dec_id_val);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
    }

    if (address) {
        uint8_t address_data[SMDSAT_CMD_READ_ADDR_LEN] = {0};
        smd_uint8_array_t address_value = {SMDSAT_CMD_READ_ADDR_LEN, address_data};
        read_address(&address_value);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
		*address  = (address_value.p_data[0] << 24) |
					(address_value.p_data[1] << 16) |
					(address_value.p_data[2] << 8)  |
					(address_value.p_data[3]);
    }

    if (seckey) {
        uint8_t seckey_data[SMDSAT_CMD_READ_SECKEY_LEN] = {0};
        smd_uint8_array_t seckey_value = {SMDSAT_CMD_READ_SECKEY_LEN, seckey_data};
        read_seckey(&seckey_value);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
        *seckey = Binascii::hexlify(std::string(reinterpret_cast<char *>(seckey_data), SMDSAT_CMD_READ_SECKEY_LEN));
    }

	SmdArgosModulation modulation_dev;
	read_radio_conf(&modulation_dev);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	(void)radioconf;

	if(stop_spi) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}
	if (m_state == SmdSatState::stopped) {
		shutdown();
	}
}

// ============================================================================
// DFU (Device Firmware Update) Implementation
// ============================================================================

// CRC-32 MPEG-2 calculation (polynomial 0x04C11DB7)
// Compatible with Zephyr argos-smd-driver
uint32_t SmdSat::calculate_crc32(const uint8_t *data, size_t len) {
	return spi_crc32_mpeg2(data, len);
}

SmdDfuResponse SmdSat::dfu_send_command(uint8_t cmd, const uint8_t *data, uint16_t data_len,
                                        uint8_t *response_data, uint16_t *response_len) {
	DEBUG_TRACE("SmdSat::%s: cmd=0x%02X, data_len=%u", __func__, cmd, data_len);

	SpiAplusResponse response;

	if (!send_command_aplus(cmd, data, data_len, &response)) {
		DEBUG_ERROR("SmdSat::%s: Command 0x%02X failed", __func__, cmd);
		return DFU_RSP_ERROR;
	}

	// Copy response data if requested
	if (response_data != nullptr && response_len != nullptr && response.data_len > 0) {
		uint16_t copy_len = (*response_len < response.data_len) ? *response_len : response.data_len;
		memcpy(response_data, response.data, copy_len);
		*response_len = copy_len;
	}

	// Map SPI A+ status to DFU response
	if (response.status == SPI_APLUS_STATUS_OK) {
		// Check if first data byte contains DFU-specific status
		if (response.data_len > 0) {
			return static_cast<SmdDfuResponse>(response.data[0]);
		}
		return DFU_RSP_OK;
	}

	return DFU_RSP_ERROR;
}

SmdDfuResponse SmdSat::dfu_ping() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	uint8_t response_data[4];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_PING, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && response_len >= 2) {
		DEBUG_INFO("SmdSat::%s: Bootloader v%u.%u", __func__,
		           response_data[0], response_data[1]);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_get_info(SmdDfuInfo *info) {
	DEBUG_TRACE("SmdSat::%s", __func__);

	if (info == nullptr) {
		return DFU_RSP_ERROR;
	}

	uint8_t response_data[16];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_GET_INFO, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && response_len >= 14) {
		info->version_major = response_data[0];
		info->version_minor = response_data[1];
		info->app_start_addr = (response_data[2] << 24) | (response_data[3] << 16) |
		                       (response_data[4] << 8) | response_data[5];
		info->app_max_size = (response_data[6] << 24) | (response_data[7] << 16) |
		                     (response_data[8] << 8) | response_data[9];
		info->flash_page_size = (response_data[10] << 24) | (response_data[11] << 16) |
		                        (response_data[12] << 8) | response_data[13];

		DEBUG_INFO("SmdSat::%s: Bootloader v%u.%u, app_start=0x%08X, max_size=%u, page_size=%u",
		           __func__, info->version_major, info->version_minor,
		           info->app_start_addr, info->app_max_size, info->flash_page_size);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_erase() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	// Erase takes time, use longer timeout
	nrf_delay_ms(100);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_ERASE, nullptr, 0, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		// Wait for erase to complete
		nrf_delay_ms(SMDSAT_DFU_ERASE_TIMEOUT_MS);
		DEBUG_INFO("SmdSat::%s: Flash erased", __func__);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_write_chunk(uint32_t addr, const uint8_t *data, uint16_t len) {
	DEBUG_TRACE("SmdSat::%s: addr=0x%08X, len=%u", __func__, addr, len);

	if (data == nullptr || len == 0 || len > SMDSAT_DFU_CHUNK_SIZE) {
		return DFU_RSP_SIZE_ERROR;
	}

	// Step 1: Send WRITE_REQ with address and length
	uint8_t req_data[6];
	req_data[0] = (addr >> 24) & 0xFF;
	req_data[1] = (addr >> 16) & 0xFF;
	req_data[2] = (addr >> 8) & 0xFF;
	req_data[3] = addr & 0xFF;
	req_data[4] = (len >> 8) & 0xFF;
	req_data[5] = len & 0xFF;

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_WRITE_REQ, req_data, 6, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: WRITE_REQ failed", __func__);
		return result;
	}

