spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	nrf_delay_ms(10);

	// Step 2: Send WRITE_DATA with actual data
	result = dfu_send_command(SMDSAT_CMD_DFU_WRITE_DATA, data, len, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: WRITE_DATA failed at addr 0x%08X", __func__, addr);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_read_chunk(uint32_t addr, uint8_t *data, uint16_t len) {
	DEBUG_TRACE("SmdSat::%s: addr=0x%08X, len=%u", __func__, addr, len);

	if (data == nullptr || len == 0) {
		return DFU_RSP_SIZE_ERROR;
	}

	// Step 1: Send READ_REQ with address and length
	uint8_t req_data[6];
	req_data[0] = (addr >> 24) & 0xFF;
	req_data[1] = (addr >> 16) & 0xFF;
	req_data[2] = (addr >> 8) & 0xFF;
	req_data[3] = addr & 0xFF;
	req_data[4] = (len >> 8) & 0xFF;
	req_data[5] = len & 0xFF;

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_READ_REQ, req_data, 6, nullptr, nullptr);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: READ_REQ failed", __func__);
		return result;
	}

	nrf_delay_ms(10);

	// Step 2: Read data
	uint16_t response_len = len;
	result = dfu_send_command(SMDSAT_CMD_DFU_READ_DATA, nullptr, 0, data, &response_len);

	return result;
}

SmdDfuResponse SmdSat::dfu_verify(uint32_t crc32) {
	DEBUG_TRACE("SmdSat::%s: crc32=0x%08X", __func__, crc32);

	uint8_t crc_data[4];
	crc_data[0] = (crc32 >> 24) & 0xFF;
	crc_data[1] = (crc32 >> 16) & 0xFF;
	crc_data[2] = (crc32 >> 8) & 0xFF;
	crc_data[3] = crc32 & 0xFF;

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_VERIFY, crc_data, 4, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		DEBUG_INFO("SmdSat::%s: CRC verification passed", __func__);
	} else {
		DEBUG_ERROR("SmdSat::%s: CRC verification failed", __func__);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_reset() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	return dfu_send_command(SMDSAT_CMD_DFU_RESET, nullptr, 0, nullptr, nullptr);
}

SmdDfuResponse SmdSat::dfu_jump() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_JUMP, nullptr, 0, nullptr, nullptr);

	if (result == DFU_RSP_OK) {
		m_dfu_mode = false;
		DEBUG_INFO("SmdSat::%s: Jumping to application", __func__);
		nrf_delay_ms(SMDSAT_DFU_RESET_DELAY_MS);
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_get_status(uint8_t *status) {
	DEBUG_TRACE("SmdSat::%s", __func__);

	uint8_t response_data[4];
	uint16_t response_len = sizeof(response_data);

	SmdDfuResponse result = dfu_send_command(SMDSAT_CMD_DFU_GET_STATUS, nullptr, 0,
	                                         response_data, &response_len);

	if (result == DFU_RSP_OK && status != nullptr && response_len >= 1) {
		*status = response_data[0];
	}

	return result;
}

SmdDfuResponse SmdSat::dfu_abort() {
	DEBUG_TRACE("SmdSat::%s", __func__);
	return dfu_send_command(SMDSAT_CMD_DFU_ABORT, nullptr, 0, nullptr, nullptr);
}

SmdDfuResponse SmdSat::dfu_set_header(const uint8_t *header) {
	DEBUG_TRACE("SmdSat::%s", __func__);

	if (header == nullptr) {
		return DFU_RSP_ERROR;
	}

	return dfu_send_command(SMDSAT_CMD_DFU_SET_HEADER, header, SMDSAT_DFU_HEADER_SIZE, nullptr, nullptr);
}

bool SmdSat::dfu_enter() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	// Ensure SPI is initialized
	bool was_stopped = (m_state == SmdSatState::stopped);
	bool stop_spi = false;

	if (was_stopped) {
		GPIOPins::clear(SAT_RESET);
		GPIOPins::set(SAT_PWR_EN);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::set(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	if (m_nrf_spim == nullptr) {
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		stop_spi = true;
	}

	// Reset protocol state for fresh detection
	m_protocol_detected = false;
	m_sequence_number = 0;

	// Wait for SMD to be ready
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);

	// Send DFU_ENTER command (0x3F)
	DEBUG_INFO("SmdSat::%s: Sending DFU_ENTER command", __func__);

	for (uint8_t retry = 0; retry < SMDSAT_DFU_MAX_RETRIES; retry++) {
		try {
			send_command(SMDSAT_CMD_DFU_ENTER);
			nrf_delay_ms(SMDSAT_DELAY_CMD_MS);

			// Read ACK
			uint8_t ack = 0;
			read_byte(&ack);

			if (ack == 0x01) {
				DEBUG_INFO("SmdSat::%s: DFU_ENTER ACK received, waiting for bootloader", __func__);

				// Wait for SMD to reset into bootloader
				nrf_delay_ms(SMDSAT_DFU_RESET_DELAY_MS * 2);

				// Reset protocol state after SMD reset
				m_protocol_detected = false;
				m_sequence_number = 0;

				// Try to ping the bootloader
				for (uint8_t ping_retry = 0; ping_retry < 5; ping_retry++) {
					nrf_delay_ms(200);
					SmdDfuResponse ping_result = dfu_ping();
					if (ping_result == DFU_RSP_OK) {
						m_dfu_mode = true;
						DEBUG_INFO("SmdSat::%s: DFU mode entered successfully", __func__);
						return true;
					}
				}

				DEBUG_ERROR("SmdSat::%s: Bootloader not responding after DFU_ENTER", __func__);
				break;
			}

			DEBUG_WARN("SmdSat::%s: DFU_ENTER no ACK (got 0x%02X), retry %u/%u",
			           __func__, ack, retry + 1, SMDSAT_DFU_MAX_RETRIES);

		} catch (...) {
			DEBUG_WARN("SmdSat::%s: DFU_ENTER failed, retry %u/%u",
			           __func__, retry + 1, SMDSAT_DFU_MAX_RETRIES);
		}
		nrf_delay_ms(SMDSAT_SPI_RETRY_DELAY_MS);
	}

	// Cleanup on failure
	if (stop_spi) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}
	if (was_stopped) {
		shutdown();
	}

	return false;
}

bool SmdSat::dfu_exit() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	if (!m_dfu_mode) {
		DEBUG_WARN("SmdSat::%s: Not in DFU mode", __func__);
		return true;  // Already in application mode
	}

	SmdDfuResponse result = dfu_jump();
	if (result == DFU_RSP_OK) {
		m_dfu_mode = false;
		return true;
	}

	return false;
}

bool SmdSat::dfu_get_bootloader_info(SmdDfuInfo *info) {
	if (!m_dfu_mode) {
		DEBUG_WARN("SmdSat::%s: Not in DFU mode", __func__);
		return false;
	}

	return (dfu_get_info(info) == DFU_RSP_OK);
}

SmdDfuResponse SmdSat::firmware_update(const uint8_t *firmware, size_t size,
                                       void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Starting firmware update, size=%u bytes", __func__, (unsigned int)size);

	if (firmware == nullptr || size == 0) {
		DEBUG_ERROR("SmdSat::%s: Invalid firmware data", __func__);
		return DFU_RSP_ERROR;
	}

