spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	SmdDfuResponse result;

	// Step 1: Enter DFU mode if not already
	if (!m_dfu_mode) {
		DEBUG_INFO("SmdSat::%s: Entering DFU mode...", __func__);
		if (!dfu_enter()) {
			DEBUG_ERROR("SmdSat::%s: Failed to enter DFU mode", __func__);
			return DFU_RSP_NOT_READY;
		}
	}

	if (progress_callback) progress_callback(5);

	// Step 2: Ping bootloader
	DEBUG_INFO("SmdSat::%s: Pinging bootloader...", __func__);
	result = dfu_ping();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Bootloader not responding", __func__);
		return result;
	}

	if (progress_callback) progress_callback(10);

	// Step 3: Get bootloader info
	DEBUG_INFO("SmdSat::%s: Getting bootloader info...", __func__);
	result = dfu_get_info(&m_dfu_info);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Failed to get bootloader info", __func__);
		return result;
	}

	// Validate firmware size
	if (size > m_dfu_info.app_max_size) {
		DEBUG_ERROR("SmdSat::%s: Firmware too large (%u > %u)", __func__,
		            (unsigned int)size, m_dfu_info.app_max_size);
		return DFU_RSP_SIZE_ERROR;
	}

	if (progress_callback) progress_callback(15);

	// Step 4: Erase application area
	DEBUG_INFO("SmdSat::%s: Erasing flash...", __func__);
	result = dfu_erase();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Flash erase failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(25);

	// Step 5: Write firmware in chunks
	DEBUG_INFO("SmdSat::%s: Writing firmware...", __func__);
	uint32_t addr = m_dfu_info.app_start_addr;
	size_t remaining = size;
	size_t offset = 0;
	uint8_t last_progress = 25;

	while (remaining > 0) {
		uint16_t chunk_size = (remaining > SMDSAT_DFU_CHUNK_SIZE) ?
		                      SMDSAT_DFU_CHUNK_SIZE : (uint16_t)remaining;

		result = dfu_write_chunk(addr, &firmware[offset], chunk_size);
		if (result != DFU_RSP_OK) {
			DEBUG_ERROR("SmdSat::%s: Write failed at offset %u", __func__, (unsigned int)offset);
			dfu_abort();
			return result;
		}

		addr += chunk_size;
		offset += chunk_size;
		remaining -= chunk_size;

		// Update progress (25% to 85% for write phase)
		if (progress_callback) {
			uint8_t progress = 25 + (uint8_t)((offset * 60) / size);
			if (progress > last_progress) {
				progress_callback(progress);
				last_progress = progress;
			}
		}

		// Small delay between chunks
		nrf_delay_ms(5);
	}

	DEBUG_INFO("SmdSat::%s: Firmware written successfully", __func__);

	if (progress_callback) progress_callback(90);

	// Step 6: Verify CRC32
	DEBUG_INFO("SmdSat::%s: Verifying firmware CRC...", __func__);
	uint32_t crc = calculate_crc32(firmware, size);
	result = dfu_verify(crc);
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: CRC verification failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(95);

	// Step 7: Jump to application
	DEBUG_INFO("SmdSat::%s: Jumping to application...", __func__);
	result = dfu_jump();
	if (result != DFU_RSP_OK) {
		DEBUG_ERROR("SmdSat::%s: Jump to application failed", __func__);
		return result;
	}

	if (progress_callback) progress_callback(100);

	DEBUG_INFO("SmdSat::%s: Firmware update completed successfully!", __func__);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update_from_file(const std::string& filepath,
                                                 void (*progress_callback)(uint8_t percent)) {
	DEBUG_INFO("SmdSat::%s: Loading firmware from %s", __func__, filepath.c_str());

	// Note: File reading requires filesystem support
	// This is a placeholder - actual implementation depends on platform filesystem

	(void)filepath;
	(void)progress_callback;

	DEBUG_ERROR("SmdSat::%s: File-based update not implemented - use firmware_update() with data buffer", __func__);
	return DFU_RSP_ERROR;
}

std::string SmdSat::get_firmware_version() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);
	bool need_spi_cleanup = false;

	// Power on SMD if needed
	if (was_stopped) {
		DEBUG_INFO("SmdSat::%s: Powering on SMD to read version", __func__);
		GPIOPins::clear(SAT_RESET);
		GPIOPins::set(SAT_PWR_EN);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::set(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	// Initialize SPI if needed
	if (m_nrf_spim == nullptr) {
		m_nrf_spim = new NrfSPIM(SPI_SATELLITE);
		need_spi_cleanup = true;
	}

	std::string version = "";

	try {
		// Send read firmware command
		send_command(SMDSAT_CMD_READ_FIRMWARE);
		nrf_delay_ms(SMDSAT_DELAY_CMD_MS);

		// Read firmware version string (128 bytes max)
		uint8_t tx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
		uint8_t rx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
		send_command(tx, rx, (uint16_t)SMDSAT_CMD_READ_FIRMWARE_LEN);

		// Find null terminator or end of buffer
		size_t len = 0;
		while (len < SMDSAT_CMD_READ_FIRMWARE_LEN && rx[len] != 0) {
			len++;
		}

		version = std::string((char*)rx, len);
		DEBUG_INFO("SmdSat::%s: Firmware version: %s", __func__, version.c_str());

	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: Failed to read firmware version", __func__);
	}

	// Cleanup if we initialized SPI
	if (need_spi_cleanup) {
		delete m_nrf_spim;
		m_nrf_spim = nullptr;
	}

	// Power off SMD if we powered it on
	if (was_stopped) {
		shutdown();
	}

	return version;
}
